src/main/resources/Schema/BusinessServices/CCMS/Common/GetContractDetails.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="GetContractDetails" targetNamespace="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/GetReferenceData" xmlns:ns2="http://schemas.oracle.com/bpel/extension" xmlns:ns1="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIM" xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:client="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/GetReferenceData" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsdl:documentation>
        <abstractWSDL>http://bbplscapp02.lab.gov:8055/soa-infra/services/default/GetContractDetails!1.0/GetContractDetails.wsdl</abstractWSDL>
    </wsdl:documentation>
    <plnk:partnerLinkType name="GetContractDetails">
        <plnk:role name="GetContractDetailsProvider">
            <plnk:portType name="client:GetContractDetails"/>
        </plnk:role>
    </plnk:partnerLinkType>
    <wsdl:types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema">
            <import namespace="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/ReferenceDataBIM" schemaLocation="../../../../../../Schema/BusinessObjects/CCMS/Common/ReferenceData/1.0/ReferenceDataBIM.xsd"/>
            <import namespace="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" schemaLocation="../../../../../../Schema/BusinessObjects/Enterprise/External/oasis/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"/>
        </schema>
    </wsdl:types>
    <wsdl:message name="GetContractDetailsRequestMessage">
        <wsdl:part name="payload" element="ns1:ContractDetailsRQ"/>
    </wsdl:message>
    <wsdl:message name="GetContractDetailsResponseMessage">
        <wsdl:part name="payload" element="ns1:ContractDetailsRS"/>
    </wsdl:message>
    <wsdl:message name="UsernameToken">
        <wsdl:part name="Security" element="wsse:Security"/>
    </wsdl:message>
    <wsdl:portType name="GetContractDetails">
        <wsdl:operation name="process">
            <wsdl:input message="client:GetContractDetailsRequestMessage"/>
            <wsdl:output message="client:GetContractDetailsResponseMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="GetContractDetailsSOAPBinding" type="client:GetContractDetails">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="process">
            <soap:operation style="document" soapAction="http://legalservices.gov.uk/CCMS/Common/ReferenceData/1.0/GetReferenceData/process"/>
            <wsdl:input>
                <soap:body use="literal" parts="payload"/>
                <soap:header message="client:UsernameToken" part="Security" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" parts="payload"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="getcontractdetails_ep">
        <wsdl:port name="GetContractDetails_pt" binding="client:GetContractDetailsSOAPBinding">
            <soap:address location="http://bbplscapp02.lab.gov:8055/soa-infra/services/default/GetContractDetails/getcontractdetails_ep"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>